In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Josh', 'Jayshil', 'Pravin', 'Aakash', 'Krenil'],
    "marks":[80, 85, 82, 75, 70],
    "state":['Gujarat','Rajasthan','Tamilnadu', 'Rajasthan', 'Gujarat'] #created a dictionary.
}

In [3]:
df = pd.DataFrame(dict1)    #crated a dataframe with arranged data.

In [4]:
df

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [5]:
df.to_csv('friends.csv')    #crated a csv file and addded data to it.

In [6]:
df.to_csv('friends_indexfalse.csv', index=False)    #created another csv but with no index.

In [7]:
df.head(3)  #first three rows.

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu

In [8]:
df.tail(2)  #last two rows.

     name  marks      state
3  Aakash     75  Rajasthan
4  Krenil     70    Gujarat

In [9]:
df.describe()   #analysis the numerical component of dataframe.

          marks
count   5.00000
mean   78.40000
std     5.94138
min    70.00000
25%    75.00000
50%    80.00000
75%    82.00000
max    85.00000

In [10]:
df['marks'] #pulling up the 'marks' column

0    80
1    85
2    82
3    75
4    70
Name: marks, dtype: int64

In [11]:
df['marks'][2]  #pulling out the 3rd component of 'marks' column

82

In [12]:
df['marks'][2] = 80 #changing the very same component's value

C:\Users\joshr\AppData\Local\Temp\ipykernel_15264\336181118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][2] = 80 #changing the very same component's value

In [13]:
df  #printed dataframe

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     80  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [14]:
df.to_csv('friends.csv')    #pushed the modified data frme to csv file.

In [15]:
df.index = ['A', 'B', 'C', 'D', 'E']    #changed the indexes of dataframe.

In [16]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [17]:
df.to_csv('friends.csv')    #exported the dtaframe to csv file.

In [18]:
josh = pd.read_csv('friends.csv')   #assigned the csv file to "josh".

In [19]:
josh

  Unnamed: 0     name  marks      state
0          A     Josh     80    Gujarat
1          B  Jayshil     85  Rajasthan
2          C   Pravin     80  Tamilnadu
3          D   Aakash     75  Rajasthan
4          E   Krenil     70    Gujarat

In [20]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [21]:
df.to_csv('friends_indexfalse.csv', index = False)

In [24]:
ser = pd.Series(np.random.rand(10)) #building a series with random float.

In [25]:
ser

0    0.040758
1    0.342711
2    0.536793
3    0.986445
4    0.003658
5    0.319305
6    0.514730
7    0.319650
8    0.472925
9    0.809303
dtype: float64